{
  "title": "welcome.md",
  "content": "# Welcome to Markdown\n\nMarkdown is a lightweight markup language that you can use to add formatting elements to plaintext text documents.\n\n## How to use this?\n\n1. Write markdown in the markdown editor window\n2. See the rendered markdown in the preview window\n\n### Features\n\n- Create headings, paragraphs, links, blockquotes, inline-code, code blocks, and lists\n- Name and save documents to access again later\n- Choose between Light or Dark mode depending on your preference\n\n> This is an example of a blockquote. If you would like to learn more about markdown syntax, you can visit this [markdown cheatsheet](https://www.markdownguide.org/cheat-sheet/).\n\n#### Headings\n\nTo create a heading, add the hash sign (#) before the heading. The number of number signs you use should correspond to the heading level. You'll see in this guide that we've used all six heading levels (not necessarily in the correct way you should use headings!) to illustrate how they should look.\n\n##### Lists\n\nYou can see examples of ordered and unordered lists above.\n\n###### Code Blocks\n\nThis markdown editor allows for inline-code snippets, like this: `<p>I'm inline</p>`. It also allows for larger code blocks like this:\n\n```html\n<main>\n  <h1>This is a larger code block</h1>\n</main>\n```\n\n### Tables\n\n| Syntax      | Description |\n| ----------- | ----------- |\n| Header      | Title       |\n| Paragraph   | Text        |\n\n### Task Lists\n\n- [x] Write the press release\n- [ ] Update the website\n- [ ] Contact the media\n\n### Emphasis\n\nYou can add emphasis by making text **bold** or *italic*.\n\n### Links and Images\n\nYou can create [links](https://www.example.com) and add ![images](https://via.placeholder.com/150).\n\n### Horizontal Rules\n\nYou can create horizontal rules with three dashes:\n\n---\n\n### Footnotes\n\nHere's a sentence with a footnote. [^1]\n\n[^1]: This is the footnote.\n\n### Strikethrough\n\n~~The world is flat.~~ We now know that the world is round.\n\n### Highlight\n\nI need to highlight these ==very important words==.\n\n### Subscript and Superscript\n\nH~2~O\n\nX^2^\n"
}
